<?php
/*
|----------------------------------------------------------------------------
| TopWindow [ Internet Ecological traffic aggregation and sharing platform ]
|----------------------------------------------------------------------------
| Copyright (c) 2006-2019 http://yangrong1.cn All rights reserved.
|----------------------------------------------------------------------------
| Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
|----------------------------------------------------------------------------
| Author: yangrong <yangrong2@gmail.com>
|----------------------------------------------------------------------------
*/

return [

    /*
    |--------------------------------------------------------------------------
    | 过滤属性和标签
    |--------------------------------------------------------------------------
    */
    'evil' => [
        'attributes' => [
            '(?<!\\w)on\\w*',
            'style',
            'xmlns',
            'formaction',
            'form',
            'xlink:href',
            'FSCommand',
            'seekSegmentTime',
        ],
        'tags' => array_map('strtolower', get_html_translation_table(HTML_ENTITIES, ENT_COMPAT | ENT_HTML5)),
    ],
	
    /*
    |--------------------------------------------------------------------------
    | 替换字符串，该字符串将用于替换该位置存在XSS的字符串的已删除部分
    |--------------------------------------------------------------------------
    */
    'replace' => null,
	
];